---
kind: property
id: P:Autodesk.Revit.DB.InternalDefinition.Id
source: html/6b71158a-443a-7220-8934-5e86271984ee.htm
---
# Autodesk.Revit.DB.InternalDefinition.Id Property

The id of the parameter.

## Syntax (C#)
```csharp
public ElementId Id { get; }
```